samdonnelly/STM32F4-driver-test/sources/app_test/rc_test.cpp
/**
 * @file rc_test.cpp
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief Remote control (RC) test 
 * 
 * @version 0.1
 * @date 2024-05-05
 * 
 * @copyright Copyright (c) 2024
 * 
 */

//=======================================================================================
// Includes 

#include "rc_test.h" 
#include "nrf24l01_config.h" 
#include "stm32f4xx_it.h" 

#include "nrf24l01_test.h" 
#include "hw125_test.h" 
#include "esc_readytosky_test.h" 

//=======================================================================================


//=======================================================================================
// Macros 

// Configuration 
#define NRF24L01_RF_FREQ 10           // Comm frequency: 2400 MHz + this value (MHz) 

//=======================================================================================


//=======================================================================================
// Classes 

// Device tracker data record 
class rc_test_trackers 
{
public: 
    // Timing information 
    TIM_TypeDef *timer_nonblocking;                // Timer used for non-blocking delays 
    tim_compare_t delay_timer;                     // Delay timing info 

    // Configuration 
    nrf24l01_data_pipe_t pipe; 

    // Payload data 
    uint8_t read_buff[NRF24L01_MAX_PAYLOAD_LEN];   // Data read by PRX from PTX device 
    uint8_t write_buff[NRF24L01_MAX_PAYLOAD_LEN];  // Data sent to PRX from PTX device 
}; 

// Device tracker instance 
static rc_test_trackers rc_test; 

//=======================================================================================


//=======================================================================================
// Prototypes 

void rc_sd_card_test_init(void); 
void rc_sd_card_test_loop(void); 
void rc_motor_test_init(void); 
void rc_motor_test_loop(void); 
void rc_ground_station_test_init(void); 
void rc_ground_station_test_loop(void); 

//=======================================================================================


//=======================================================================================
// Setup code 

// Remote control test setup code 
void rc_test_init(void)
{
    // Universal (to all nrf24l01 tests) setup code 

    //==================================================
    // General setup 

    // Initialize GPIO ports 
    gpio_port_init(); 

    // General purpose timer 
    tim_9_to_11_counter_init(
        TIM9, 
        TIM_84MHZ_1US_PSC, 
        0xFFFF,  // Max ARR value 
        TIM_UP_INT_DISABLE); 
    tim_enable(TIM9); 

    // Configure the board LED to blink when transmitting. 
    gpio_pin_init(GPIOA, PIN_5, MODER_GPO, OTYPER_PP, OSPEEDR_HIGH, PUPDR_NO); 
    gpio_write(GPIOA, GPIOX_PIN_5, GPIO_LOW); 
    
    //==================================================

    //==================================================
    // UART initialization 

    // Initialize UART
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE);   // DMA enabled so it can be configured later 

    //==================================================

    //==================================================
    // Initialize I2C / screen 

#if HD44780U_ON_I2C_BUS 

    // Initialize the screen so it can be turned off 

    // Initialize I2C1 
    i2c_init(
        I2C1, 
        PIN_9, 
        GPIOB, 
        PIN_8, 
        GPIOB, 
        I2C_MODE_SM,
        I2C_APB1_42MHZ,
        I2C_CCR_SM_42_100,
        I2C_TRISE_1000_42);

    hd44780u_init(I2C1, TIM9, PCF8574_ADDR_HHH); 
    hd44780u_clear(); 
    hd44780u_backlight_off(); 

#endif   // HD44780U_ON_I2C_BUS 

    //==================================================

    //==================================================
    // Initialize SPI 

    // SPI for the RF module 
    spi_init(
        SPI2, 
        GPIOB,   // GPIO port for SCK pin 
        PIN_10,  // SCK pin 
        GPIOC,   // GPIO port for data (MISO/MOSI) pins 
        PIN_2,   // MISO pin 
        PIN_3,   // MOSI pin 
        SPI_BR_FPCLK_16, 
        SPI_CLOCK_MODE_0); 

    //==================================================

    //==================================================
    // Initialize test data 

    // Timing 
    rc_test.timer_nonblocking = TIM9; 
    rc_test.delay_timer.clk_freq = tim_get_pclk_freq(rc_test.timer_nonblocking); 
    rc_test.delay_timer.time_cnt_total = CLEAR; 
    rc_test.delay_timer.time_cnt = CLEAR; 
    rc_test.delay_timer.time_start = SET_BIT; 

    // Configuration 
    rc_test.pipe = NRF24L01_DP_1; 

    // Payload data 
    memset((void *)rc_test.read_buff, CLEAR, sizeof(rc_test.read_buff)); 
    memset((void *)rc_test.write_buff, CLEAR, sizeof(rc_test.write_buff)); 

    //==================================================

    //==================================================
    // Initialize the device driver 

    NRF24L01_STATUS nrf24l01_init_status = NRF24L01_OK; 

    // General setup common to all devices - must be called once during setup 
    nrf24l01_init_status |= nrf24l01_init(
        SPI2,                    // SPI port to use 
        GPIOC,                   // Slave select pin GPIO port 
        PIN_1,                   // Slave select pin number 
        GPIOC,                   // Enable pin (CE) GPIO port 
        PIN_0,                   // Enable pin (CE) number 
        TIM9,                    // General purpose timer port 
        NRF24L01_RF_FREQ,        // Initial RF channel frequency 
        NRF24L01_DR_2MBPS,       // Initial data rate to communicate at 
        NRF24L01_RF_PWR_0DBM);   // Initial power output to use 

    // Configure the PTX and PRX settings depending on the devices role/purpose. 
    nrf24l01_init_status |= nrf24l01_ptx_config(nrf24l01_pipe_addr); 
    nrf24l01_init_status |= nrf24l01_prx_config(nrf24l01_pipe_addr, rc_test.pipe); 

