samdonnelly/STM32F4-driver-test/sources/app_test/rc_test.cpp
    // Power up the device now that it is configured 
    nrf24l01_init_status |= nrf24l01_pwr_up(); 

    // Check init status 
    if (nrf24l01_init_status)
    {
        uart_sendstring(USART2, "nRF24L01 init failed."); 
        while(1); 
    }
    else 
    {
        uart_sendstring(USART2, "nRF24L01 init success."); 
    }

    //==================================================

#if RC_SD_CARD_TEST 
    rc_sd_card_test_init(); 
#elif RC_MOTOR_TEST 
    rc_motor_test_init(); 
#elif RC_GROUND_STATION_TEST 
    rc_ground_station_test_init(); 
#endif 
}

//=======================================================================================


//=======================================================================================
// Test code 

// Remote control test code 
void rc_test_app(void)
{
#if RC_SD_CARD_TEST 
    rc_sd_card_test_loop(); 
#elif RC_MOTOR_TEST 
    rc_motor_test_loop(); 
#elif RC_GROUND_STATION_TEST 
    rc_ground_station_test_loop(); 
#endif 
}

//=======================================================================================


#if RC_SD_CARD_TEST 

//=======================================================================================
// SD card test 

// Description 
// - System 1: 
//   - Look for serial terminal input from a user. Valid inputs are "push" followed by 
//     a string or "pop". 
//   - If an inout matches a pre-defined command then execute the command callback. 
//   - Callback 1: ("push") 
//     - Send a push request to system 2. 
//     - If a response is seen then send the string/message to system 2. 
//     - If a confirmation is received then indicate success back to the user. 
//     - If no response is seen then it's considered a fail and system 1 goes back to 
//       looking for user input. 
//   - Callback 2: ("pop") 
//     - Send a pop request to system 2. 
//     - If a response is seen then output the response to the serial terminal for the 
//       user to see. 
// 
// - System 2: 
//   - Look for a message from system 1. 
//   - Attempt to match an input to a pre-defined command. If there is a match then 
//     the command callback is executed. 
//   - Callback 1: ("push") 
//     - Send a push confirmation message to system 1. 
//     - Wait for a message from system 1. 
//     - If a message is received then save it to the SD card and send a confirmation 
//       back to system 1. 
//   - Callback 2: ("pop") 
//     - Get the most recent message from the SD card file and send it back to system 
//       1. Delete the message from the file. 

//==================================================
// Macros 

// Timing 
#define RC_SD_PERIOD 50000          // (us) 
#define RC_SD_PUSH_MSG_TIMEOUT 20   // Counts 
#define RC_SD_PUSH_MSG_DELAY 10     // (ms) 

// Commands 
#define RC_SD_NUM_CMDS 2 

//==================================================


//==================================================
// Prototypes 

// "push" callback 
void rc_test_push_callback(
    uint8_t arg_value, 
    uint8_t *arg_str); 

// "pop" callback 
void rc_test_pop_callback(
    uint8_t arg_value, 
    uint8_t *arg_str); 

//==================================================


//==================================================
// Variables 

// Messages sent between system 
static const char 
push_cmd[] = "push",   // Doubles as a user command 
pop_cmd[] = "pop", 
push_confirm[] = "push confirm", 
msg_confirm[] = "msg confirm"; 

// Command table 
static const nrf24l01_cmds_t rc_cmd_table[RC_SD_NUM_CMDS] = 
{
    {push_cmd, &rc_test_push_callback}, 
    {pop_cmd,  &rc_test_pop_callback} 
};

#if RC_SYSTEM_1 

static const char 
push_status[] = "Push requested... ", 
push_success[] = "message saved.", 
pop_status[] = "Popped message: "; 

// Command data 
static nrf24l01_cmd_data_t rc_cmd_data; 

#elif RC_SYSTEM_2 

static const char 
no_msgs[] = "No messages to pop."; 

#endif 

//==================================================


//==================================================
// Setup 

void rc_sd_card_test_init(void)
{
#if RC_SYSTEM_1 

    //==================================================
    // UART DMA 

    // Enable the IDLE line interrupt 
    uart_interrupt_init(
        USART2, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // Initialize the DMA stream for the UART 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // Configure the DMA stream for the UART 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)rc_cmd_data.cb, 
        (uint16_t)NRF24L01_MAX_PAYLOAD_LEN); 

    // Enable the DMA stream for the UART 
    dma_stream_enable(DMA1_Stream5); 

    // Initialize interrupt handler flags (called once) 
    int_handler_init(); 

    // Enable the interrupt handlers (called for each interrupt) - for USART2_RX 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_0); 

    //==================================================

    memset((void *)rc_cmd_data.cb, CLEAR, sizeof(rc_cmd_data.cb)); 
    rc_cmd_data.cb_index = CLEAR; 
    memset((void *)rc_cmd_data.cmd_buff, CLEAR, sizeof(rc_cmd_data.cmd_buff)); 
    memset((void *)rc_cmd_data.cmd_id, CLEAR, sizeof(rc_cmd_data.cmd_id)); 
    rc_cmd_data.cmd_value = CLEAR; 

    // Provide an initial prompt for the user 
    uart_sendstring(USART2, "\r\n\n>>> "); 

#elif RC_SYSTEM_2 

    //==================================================
    // Initialize SPI 
    
    // The same SPI network (ex. SPI2) can't be used on multiple pins. Didn't work when 
    // initialization for the same SPI port on was done on multiple pins. Must use a 
    // different SPI port or only use one set of pins. 

    //==================================================

    //==================================================
    // Initialize SD card 

