samdonnelly/STM32F4-driver-test/sources/app_test/rc_test.cpp
    // SD card user initialization 

    // Mount the drive 

    // Check for the test directory 
    // - If it doesn't exist then create it. 

    // Open the file with FA_OPEN_APPEND (HW125_MODE_AA) to either open the existing 
    // file or create a new one and move to the end of the file. 

    // Close the file. Will be opened for each read/write operation. 
    
    //==================================================
    
#endif 
}

//==================================================


//==================================================
// Loop 

void rc_sd_card_test_loop(void)
{
#if RC_SYSTEM_1 

    // Check for user input and match inputs to commands 
    nrf24l01_test_user_input(&rc_cmd_data, rc_cmd_table, RC_SD_NUM_CMDS, NRF24L01_CMD_ARG_STR); 

#elif RC_SYSTEM_2 

    // Periodically check for action items 
    if (tim_compare(rc_test.timer_nonblocking, 
                    rc_test.delay_timer.clk_freq, 
                    RC_SD_PERIOD, 
                    &rc_test.delay_timer.time_cnt_total, 
                    &rc_test.delay_timer.time_cnt, 
                    &rc_test.delay_timer.time_start))
    {
        // time_start flag does not need to be set again because this timer runs 
        // continuously. 

        // Look for a message from system 1 
        if (nrf24l01_data_ready_status() == rc_test.pipe)
        {
            nrf24l01_receive_payload(rc_test.read_buff); 
            
            // Compare the input to the available commands 
            for (uint8_t i = CLEAR; i < RC_SD_NUM_CMDS; i++) 
            {
                if (!strcmp(rc_cmd_table[i].user_cmds, (char *)rc_test.read_buff))
                {
                    // ID matched to a command. Execute the command callback. 
                    (rc_cmd_table[i].cmd_ptr)(CLEAR, NULL); 
                    break; 
                }
            }
        }
    }

#endif 
}

//==================================================


//==================================================
// Test functions 

// "push" callback 
void rc_test_push_callback(
    uint8_t arg_value, 
    uint8_t *arg_str)
{
#if RC_SYSTEM_1 

    // Send a "push" command to system 2 
    nrf24l01_send_payload((uint8_t *)push_cmd); 

    // Provide user feedback 
    uart_sendstring(USART2, push_status); 

    // Check repeatedly for a push confirmation message. If the confirmation is received 
    // within the time limit then send the message to system 2. 
    for (uint8_t i = CLEAR; i < RC_SD_PUSH_MSG_TIMEOUT; i++)
    {
        tim_delay_ms(rc_test.timer_nonblocking, RC_SD_PUSH_MSG_DELAY); 

        if (nrf24l01_data_ready_status() == rc_test.pipe)
        {
            nrf24l01_receive_payload(rc_test.read_buff); 

            if (!strcmp(push_confirm, (char *)rc_test.read_buff))
            {
                // Send the message to system 2 
                // nrf24l01_send_payload(rc_cmd_data.cmd_str); 
                nrf24l01_send_payload(arg_str); 

                // Check repeatedly for a message received confirmation. If the 
                // confirmation is received within the time limit then provide feedback 
                // to the user that the operation was successful. 
                for (uint8_t j = CLEAR; j < RC_SD_PUSH_MSG_TIMEOUT; j++)
                {
                    tim_delay_ms(rc_test.timer_nonblocking, RC_SD_PUSH_MSG_DELAY); 

                    // Look for a message from system 2 
                    if (nrf24l01_data_ready_status() == rc_test.pipe)
                    {
                        nrf24l01_receive_payload(rc_test.read_buff); 

                        if (!strcmp(msg_confirm, (char *)rc_test.read_buff))
                        {
                            // Output a confirmation 
                            uart_sendstring(USART2, push_success); 
                            break; 
                        }
                    }
                }

                break; 
            }
        }
    }

#elif RC_SYSTEM_2 

    // Send a confirmation to system 1 that a "push" command was received 
    nrf24l01_send_payload((uint8_t *)push_confirm); 

    // Check multiple times (with a delay) if a message arrives 
    for (uint8_t i = CLEAR; i < RC_SD_PUSH_MSG_TIMEOUT; i++)
    {
        tim_delay_ms(rc_test.timer_nonblocking, RC_SD_PUSH_MSG_DELAY); 

        // Look for a message from system 1 
        if (nrf24l01_data_ready_status() == rc_test.pipe)
        {
            nrf24l01_receive_payload(rc_test.read_buff); 

            // Save the contents to the end of the test file on the SD card 

            // Send another confirmation to system 1 that the message was received 
            nrf24l01_send_payload((uint8_t *)msg_confirm); 
        }
    }

#endif 
}


// "pop" callback 
void rc_test_pop_callback(
    uint8_t arg, 
    uint8_t *arg_str)
{
#if RC_SYSTEM_1 

    // Send a "pop" command to system 2 
    nrf24l01_send_payload((uint8_t *)pop_cmd); 

    // Provide user feedback 
    uart_sendstring(USART2, pop_status); 

    // Check repeatedly for a message from system 2. If a message is received then 
    // output it for the user to see. 
    for (uint8_t i = CLEAR; i < RC_SD_PUSH_MSG_TIMEOUT; i++)
    {
        tim_delay_ms(rc_test.timer_nonblocking, RC_SD_PUSH_MSG_DELAY); 

        if (nrf24l01_data_ready_status() == rc_test.pipe)
        {
            nrf24l01_receive_payload(rc_test.read_buff); 
            uart_sendstring(USART2, (char *)rc_test.read_buff); 
            break; 
        }
    }

#elif RC_SYSTEM_2 

    // Get the most recent message from the test file on the SD card 
    // If there are none left then send the indication back to system 1. 

    // Send the message back to system 1 - temp message for now 
    nrf24l01_send_payload((uint8_t *)no_msgs); 

#endif 
}

//==================================================

//=======================================================================================


#elif RC_MOTOR_TEST 

//=======================================================================================
// Remote control motor test 

