samdonnelly/STM32F4-driver-test/sources/app_test/rc_test.cpp
// Description 
// - System 1 reads two ADC values, one for each motor in system 2. The ADC values get 
//   converted to a throttle command and a message gets sent to system 2 that indicates 
//   the motor, direction and throttle to apply. 
// - System 2 looks for messages from system 1 that contain commands for the throttle to 
//   apply to each motor. The messages get decoded and the motor speed updated. If the 
//   system loses radio connection (i.e. no message/command is received after a period 
//   of time) then the motor speed is set to zero. 

//==================================================
// Macros 

// Command IDs 
#define RC_MOTOR_LEFT_MOTOR 0x4C          // "L" character that indicates left motor 
#define RC_MOTOR_RIGHT_MOTOR 0x52         // "R" character that indicates right motor 
#define RC_MOTOR_FWD_THRUST 0x50          // "P" (plus) - indicates forward thrust 
#define RC_MOTOR_REV_THRUST 0x4D          // "M" (minus) - indicates reverse thrust 
#define RC_MOTOR_NEUTRAL 0x4E             // "N" (neutral) - indicates zero thrust 
#define RC_MOTOR_NO_THRUST 0              // Force thruster output to zero 

// Timing 
#define RC_MOTOR_TIMEOUT 20               // No radio connection timeout counter 
#define RC_MOTOR_SEND_PERIOD 100000       // Time between throttle command sends (us) 
#define RC_MOTOR_RECEIVE_PERIOD 50000     // Time between throttle command sends (us) 

// System parameters 
#define RC_MOTOR_TEST_ADC_NUM 2           // Number of ADCs used for throttle command 
#define RC_MOTOR_ESC_PERIOD 20000         // ESC PWM timer period (auto-reload register) 
#define RC_MOTOR_ESC_FWD_SPEED_LIM 1600   // Forward PWM pulse time limit (us) 
#define RC_MOTOR_ESC_REV_SPEED_LIM 1440   // Reverse PWM pulse time limit (us) 

//==================================================


//==================================================
// Variables 

#if RC_SYSTEM_1 

// ADC storage - Location for the DMA to store ADC values 
static uint16_t adc_data[RC_MOTOR_TEST_ADC_NUM]; 

#elif RC_SYSTEM_2 

// Command data 
static nrf24l01_cmd_data_t rc_cmd_data; 

#endif 

//==================================================


//==================================================
// Prototypes 

#if RC_SYSTEM_1 
#elif RC_SYSTEM_2 

/**
 * @brief Thruster output 
 * 
 * @param timer : radio connection timeout counter 
 * @param device : device number (left vs right thruster) 
 * @param throttle : throttle command 
 */
void rc_test_thruster_output(
    uint8_t *timer, 
    device_number_t device, 
    int16_t throttle); 


/**
 * @brief Radio connection check 
 * 
 * @param timer : radio connection timeout counter 
 */
void rc_test_no_radio(uint8_t *timer); 

#endif 

//==================================================


//==================================================
// Setup 

void rc_motor_test_init(void)
{
#if RC_SYSTEM_1 

    //===================================================
    // ADC setup - for user controller mode 

    // Initialize the ADC port (called once) 
    adc1_clock_enable(RCC); 
    adc_port_init(
        ADC1, 
        ADC1_COMMON, 
        ADC_PCLK2_4, 
        ADC_RES_8, 
        ADC_PARAM_ENABLE,      // ADC_EOC_EACH 
        ADC_PARAM_DISABLE,     // ADC_EOC_INT_DISABLE 
        ADC_PARAM_ENABLE,      // ADC_SCAN_ENABLE 
        ADC_PARAM_ENABLE,      // ADC_CONT_ENABLE 
        ADC_PARAM_ENABLE,      // ADC_DMA_ENABLE 
        ADC_PARAM_ENABLE,      // ADC_DDS_ENABLE 
        ADC_PARAM_DISABLE);    // ADC_OVR_INT_DISABLE 

    // Initialize the ADC pins and channels (called for each pin/channel) 
    // Right and left thruster control (potentiometer) in manual control mode 
    adc_pin_init(ADC1, GPIOA, PIN_6, ADC_CHANNEL_6, ADC_SMP_15); 
    adc_pin_init(ADC1, GPIOA, PIN_7, ADC_CHANNEL_7, ADC_SMP_15); 

    // Set the ADC conversion sequence (called for each sequence entry) 
    adc_seq(ADC1, ADC_CHANNEL_6, ADC_SEQ_1); 
    adc_seq(ADC1, ADC_CHANNEL_7, ADC_SEQ_2); 

    // Set the sequence length (called once and only for more than one channel) 
    adc_seq_len_set(ADC1, ADC_SEQ_2); 

    // Turn the ADC on 
    adc_on(ADC1); 
    
    //===================================================

    //==================================================
    // Initialize DMA 

    // Initialize the DMA stream for the ADC 
    dma_stream_init(
        DMA2, 
        DMA2_Stream0, 
        DMA_CHNL_0, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_HALF, 
        DMA_DATA_SIZE_HALF); 

    // Configure the DMA stream for the ADC 
    dma_stream_config(
        DMA2_Stream0, 
        (uint32_t)(&ADC1->DR), 
        (uint32_t)adc_data, 
        (uint16_t)RC_MOTOR_TEST_ADC_NUM); 

    // Enable the DMA stream for the ADC 
    dma_stream_enable(DMA2_Stream0); 

    // Start the ADC conversions (continuous mode) 
    adc_start(ADC1); 

    //==================================================

    memset((void *)adc_data, CLEAR, sizeof(adc_data)); 

#elif RC_SYSTEM_2 

    //==================================================
    // ESC/motor setup 

    // ESC driver setup 
    esc_readytosky_init(
        DEVICE_ONE, 
        TIM3, 
        TIMER_CH4, 
        GPIOB, 
        PIN_1, 
        TIM_84MHZ_1US_PSC, 
        RC_MOTOR_ESC_PERIOD, 
        RC_MOTOR_ESC_FWD_SPEED_LIM, 
        RC_MOTOR_ESC_REV_SPEED_LIM); 

    esc_readytosky_init(
        DEVICE_TWO, 
        TIM3, 
        TIMER_CH3, 
        GPIOB, 
        PIN_0, 
        TIM_84MHZ_1US_PSC, 
        RC_MOTOR_ESC_PERIOD, 
        RC_MOTOR_ESC_FWD_SPEED_LIM, 
        RC_MOTOR_ESC_REV_SPEED_LIM); 

    tim_enable(TIM3); 
    
    //==================================================

    memset((void *)rc_cmd_data.cb, CLEAR, sizeof(rc_cmd_data.cb)); 
    rc_cmd_data.cb_index = CLEAR; 
    memset((void *)rc_cmd_data.cmd_buff, CLEAR, sizeof(rc_cmd_data.cmd_buff)); 
    memset((void *)rc_cmd_data.cmd_id, CLEAR, sizeof(rc_cmd_data.cmd_id)); 
    rc_cmd_data.cmd_value = CLEAR; 

#endif 
}

//==================================================


//==================================================
// Loop 

void rc_motor_test_loop(void)
{
#if RC_SYSTEM_1 

    static gpio_pin_state_t led_state = GPIO_LOW; 
    static uint8_t thruster = CLEAR; 
    char side = CLEAR; 
    char sign = RC_MOTOR_FWD_THRUST; 
    int16_t throttle = CLEAR; 

    if (tim_compare(rc_test.timer_nonblocking, 
                    rc_test.delay_timer.clk_freq, 
                    RC_MOTOR_SEND_PERIOD, 
                    &rc_test.delay_timer.time_cnt_total, 
                    &rc_test.delay_timer.time_cnt, 
                    &rc_test.delay_timer.time_start))
    {
        // time_start flag does not need to be set again because this timer runs 
        // continuously. 

        // Choose between right and left thruster 
        side = (thruster) ? RC_MOTOR_LEFT_MOTOR : RC_MOTOR_RIGHT_MOTOR; 

        // Read the ADC input and format the value for writing to the payload 
        throttle = esc_test_adc_mapping(adc_data[thruster]); 

        if (throttle == RC_MOTOR_NO_THRUST)
        {
            sign = RC_MOTOR_NEUTRAL; 
        }
        else if (throttle < RC_MOTOR_NO_THRUST)
        {
            // If the throttle is negative then change the value to positive and set the sign 
            // in the payload as negative. This helps on the receiving end. 
            throttle = ~throttle + 1; 
            sign = RC_MOTOR_REV_THRUST; 
        }

        // Format the payload with the thruster specifier and the throttle then send the 
        // payload. 
        snprintf(
            (char *)rc_test.write_buff, 
            NRF24L01_MAX_PAYLOAD_LEN, 
            "%c%c %d", 
            side, sign, throttle); 

        if (nrf24l01_send_payload(rc_test.write_buff) == NRF24L01_OK)
        {
            led_state = (gpio_pin_state_t)(GPIO_HIGH - led_state); 
            gpio_write(GPIOA, GPIOX_PIN_5, led_state); 
        } 

        // Toggle the thruster flag 
        thruster = SET_BIT - thruster; 
    }

#elif RC_SYSTEM_2 

    static uint8_t timeout = CLEAR; 

    if (tim_compare(rc_test.timer_nonblocking, 
                    rc_test.delay_timer.clk_freq, 
                    RC_MOTOR_RECEIVE_PERIOD, 
                    &rc_test.delay_timer.time_cnt_total, 
                    &rc_test.delay_timer.time_cnt, 
                    &rc_test.delay_timer.time_start))
    {
        // time_start flag does not need to be set again because this timer runs 
        // continuously. 

        // Check if a payload has been received 
        if (nrf24l01_data_ready_status() == rc_test.pipe)
        {
            // Payload has been received. Read the payload from the device RX FIFO. 
            nrf24l01_receive_payload(rc_cmd_data.cmd_buff); 

