samdonnelly/STM32F4-driver-test/sources/app_test/rc_test.cpp
            // Validate the payload format 
            if (nrf24l01_test_parse_cmd(&rc_cmd_data, NRF24L01_CMD_ARG_VALUE))
            {
                // Check that the command matches a valid throttle command. If it does then update 
                // the thruster command. Throttle command filtering is done by system 1. 

                int16_t cmd_value = (int16_t)rc_cmd_data.cmd_value; 
                int16_t throttle = RC_MOTOR_NO_THRUST; 
                uint8_t motor = rc_cmd_data.cmd_id[0]; 
                uint8_t direction = rc_cmd_data.cmd_id[1]; 

                // Determine the throttle command 
                if (direction == RC_MOTOR_FWD_THRUST)
                {
                    throttle = cmd_value; 
                }
                else if (direction == RC_MOTOR_REV_THRUST)
                {
                    throttle = ~cmd_value + 1; 
                }

                // Determine the motor 
                if (motor == RC_MOTOR_RIGHT_MOTOR)
                {
                    rc_test_thruster_output(&timeout, DEVICE_ONE, throttle); 
                }
                else if (motor == RC_MOTOR_LEFT_MOTOR)
                {
                    rc_test_thruster_output(&timeout, DEVICE_TWO, throttle); 
                }
            }
            else 
            {
                rc_test_no_radio(&timeout); 
            }
        }
        else 
        {
            rc_test_no_radio(&timeout); 
        }
    }

#endif 
}

//==================================================


//==================================================
// Test functions 

#if RC_SYSTEM_1 
#elif RC_SYSTEM_2 

// Thruster output 
void rc_test_thruster_output(
    uint8_t *timer, 
    device_number_t device, 
    int16_t throttle)
{
    // Radio connected - clear timeout 
    *timer = CLEAR; 
    esc_readytosky_send(device, throttle); 
}


// Radio connection check 
void rc_test_no_radio(uint8_t *timer)
{
    if (++*timer > RC_MOTOR_TIMEOUT)
    {
        rc_test_thruster_output(timer, DEVICE_ONE, RC_MOTOR_NO_THRUST); 
        rc_test_thruster_output(timer, DEVICE_TWO, RC_MOTOR_NO_THRUST); 
    }
}

#endif 

//==================================================

//=======================================================================================


#elif RC_GROUND_STATION_TEST 

//=======================================================================================
// Ground station test 

// Description 
// - Simple radio ground station that sends out inputs from the user and looks for 
//   responses. Inputs come from the serial terminal and responses are output to the 
//   serial terminal. This is not a two way test, but rather used to test any system 
//   that is controlled by a radio ground station. 

//==================================================
// Macros 

// Timing 
#define RC_GS_ACTION_PERIOD 100000     // Time between throttle command sends (us) 
#define RC_GS_HB_SEND_COUNTER 20       // This * RC_GS_ACTION_PERIOD gives HB send period 
#define RC_GS_HB_TIMEOUT_COUNTER 100   // This * RC_GS_ACTION_PERIOD gives HB timeout 

//==================================================


//==================================================
// Variables 

#if RC_SYSTEM_1 

// Command data 
static nrf24l01_cmd_data_t rc_gs_cmd_data; 
static const char 
ping_msg[] = "ping", 
ping_response[] = "pong", 
lost_connection[] = "Radio lost\033[1A"; 

#elif RC_SYSTEM_2 
#endif 

//==================================================


//==================================================
// Prototypes 

#if RC_SYSTEM_1 

/**
 * @brief User terminal prompt 
 */
void rc_ground_station_user_prompt(void); 

#elif RC_SYSTEM_2 
#endif 

//==================================================


//==================================================
// Setup 

void rc_ground_station_test_init(void)
{
#if RC_SYSTEM_1 

    //==================================================
    // UART DMA - further configure the UART for DMA input 

    // Enable the IDLE line interrupt 
    uart_interrupt_init(
        USART2, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // Initialize the DMA stream for the UART 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_DBM_DISABLE, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // Configure the DMA stream for the UART 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)rc_gs_cmd_data.cb, 
        (uint32_t)NULL, 
        (uint16_t)NRF24L01_TEST_MAX_INPUT); 

    // Enable the DMA stream for the UART 
    dma_stream_enable(DMA1_Stream5); 

    // Initialize interrupt handler flags (called once) 
    int_handler_init(); 

    // Enable the interrupt handlers (called for each interrupt) - for USART2_RX 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_0); 

    //==================================================

    memset((void *)rc_gs_cmd_data.cb, CLEAR, sizeof(rc_gs_cmd_data.cb)); 
    rc_gs_cmd_data.cb_index = CLEAR; 
    memset((void *)rc_gs_cmd_data.cmd_buff, CLEAR, sizeof(rc_gs_cmd_data.cmd_buff)); 
    memset((void *)rc_gs_cmd_data.cmd_id, CLEAR, sizeof(rc_gs_cmd_data.cmd_id)); 
    rc_gs_cmd_data.cmd_value = CLEAR; 
    memset((void *)rc_gs_cmd_data.cmd_str, CLEAR, sizeof(rc_gs_cmd_data.cmd_str)); 

    rc_ground_station_user_prompt(); 

#elif RC_SYSTEM_2 
#endif 
}

//==================================================


//==================================================
// Loop 

void rc_ground_station_test_loop(void)
{
#if RC_SYSTEM_1 

    static uint8_t hb_send_counter = CLEAR; 
    static uint8_t hb_timeout_counter = CLEAR; 

    // Check for user serial terminal input 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR; 

        // Copy the new contents in the circular buffer to the user input buffer 
        cb_parse(
            rc_gs_cmd_data.cb, 
            rc_gs_cmd_data.cmd_buff, 
            &rc_gs_cmd_data.cb_index, 
            NRF24L01_TEST_MAX_INPUT); 

        // Send string 
        nrf24l01_send_payload(rc_gs_cmd_data.cmd_buff); 

        rc_ground_station_user_prompt(); 
    }

    // Periodically check for action items 
    if (tim_compare(rc_test.timer_nonblocking, 
                    rc_test.delay_timer.clk_freq, 
                    RC_GS_ACTION_PERIOD, 
                    &rc_test.delay_timer.time_cnt_total, 
                    &rc_test.delay_timer.time_cnt, 
                    &rc_test.delay_timer.time_start))
    {
        // time_start flag does not need to be set again because this timer runs 
        // continuously. 

        // Look for an incoming message from the remote system 
        if (nrf24l01_data_ready_status() == rc_test.pipe)
        {
            nrf24l01_receive_payload(rc_test.read_buff); 

            // Clear the timeout for any message received 
            hb_timeout_counter = CLEAR; 

            if (strcmp((char *)rc_test.read_buff, ping_response) != 0)
            {
                // Display the message for the ground station to see 
                uart_sendstring(USART2, "\033[1A\033[1A\r"); 
                uart_sendstring(USART2, (char *)rc_test.read_buff); 
                rc_ground_station_user_prompt(); 
            }
        }

        // Check if the radio connection had been lost for too long 
        if (hb_timeout_counter++ >= RC_GS_HB_TIMEOUT_COUNTER)
        {
            hb_timeout_counter = CLEAR; 
            
            // Display a lost connection message 
            uart_sendstring(USART2, "\033[1A\r"); 
            uart_sendstring(USART2, lost_connection); 
            rc_ground_station_user_prompt(); 
        }

        // Send a heartbeat message to the remote system periodically 
        if (hb_send_counter++ >= RC_GS_HB_SEND_COUNTER)
        {
            hb_send_counter = CLEAR; 
            nrf24l01_send_payload((uint8_t *)ping_msg); 
        }
    }

#elif RC_SYSTEM_2 
#endif 
}

//==================================================


//==================================================
// Test functions 

#if RC_SYSTEM_1 

// User terminal prompt 
void rc_ground_station_user_prompt(void)
{
    uart_sendstring(USART2, "\r\n\n>>> "); 
}

#elif RC_SYSTEM_2 
#endif 

//==================================================

//=======================================================================================

#endif 
